In [1]:
import numpy as np
import pandas as pd

In [4]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [5]:
s.sum()

6

In [6]:
print(f'mean: {s.mean()}, min: {s.min()}, max: {s.max()}')

mean: 2.0, min: 1, max: 3

In [7]:
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df

   A  B
0  1  3
1  2  4

In [8]:
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0 -0.116827 -0.695671  1.161651 -1.324611
1  0.071837 -0.628083 -2.891726  0.993048
2 -1.241228 -2.467313  0.667647 -0.320286
3  0.009642 -0.198546 -0.356046  0.174781
4  0.073361  0.193129  1.180616  0.939739
5 -0.134294  0.338118  1.669570 -0.991810

In [10]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20220101', periods=6))
df

                   0         1         2         3
2022-01-01 -1.074977 -0.254770  1.532569  0.462964
2022-01-02 -0.403983  0.473897 -0.077661  0.099358
2022-01-03 -1.554363  0.346386 -0.062968 -0.794618
2022-01-04  0.324516 -2.074796  0.658253  0.989352
2022-01-05  0.305938 -0.399716  1.262047  0.589703
2022-01-06  1.455378 -0.739769 -0.020022 -0.284015

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20220101', periods=6), columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2022-01-01 -1.183414  0.770003 -0.060545 -1.236191
2022-01-02  1.002429  1.563290  0.035916 -0.355778
2022-01-03 -0.785224 -0.281932 -1.140960 -1.265404
2022-01-04 -0.314098  2.445542 -0.863728 -1.407650
2022-01-05 -0.142732  1.139294  0.914375 -0.109881
2022-01-06 -1.086993 -1.355432  2.170600 -0.791787

In [12]:
df.T

   2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
A   -1.183414    1.002429   -0.785224   -0.314098   -0.142732   -1.086993
B    0.770003    1.563290   -0.281932    2.445542    1.139294   -1.355432
C   -0.060545    0.035916   -1.140960   -0.863728    0.914375    2.170600
D   -1.236191   -0.355778   -1.265404   -1.407650   -0.109881   -0.791787

In [13]:
df.head(1)

                   A         B         C         D
2022-01-01 -1.183414  0.770003 -0.060545 -1.236191

In [14]:
df.tail(3)

                   A         B         C         D
2022-01-04 -0.314098  2.445542 -0.863728 -1.407650
2022-01-05 -0.142732  1.139294  0.914375 -0.109881
2022-01-06 -1.086993 -1.355432  2.170600 -0.791787

In [15]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[-1.18341381,  0.77000349, -0.06054484, -1.23619083],
       [ 1.00242945,  1.56329011,  0.03591574, -0.35577841],
       [-0.78522398, -0.28193193, -1.14096025, -1.26540424],
       [-0.31409774,  2.44554236, -0.86372827, -1.40765043],
       [-0.14273218,  1.13929351,  0.91437523, -0.10988063],
       [-1.08699331, -1.35543227,  2.17060025, -0.79178717]])

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.418339  0.713461  0.175943 -0.861115
std    0.809006  1.354841  1.217754  0.534295
min   -1.183414 -1.355432 -1.140960 -1.407650
25%   -1.011551 -0.018948 -0.662932 -1.258101
50%   -0.549661  0.954648 -0.012315 -1.013989
75%   -0.185574  1.457291  0.694760 -0.464781
max    1.002429  2.445542  2.170600 -0.109881

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2022-01-06 -1.086993 -1.355432  2.170600 -0.791787
2022-01-03 -0.785224 -0.281932 -1.140960 -1.265404
2022-01-01 -1.183414  0.770003 -0.060545 -1.236191
2022-01-05 -0.142732  1.139294  0.914375 -0.109881
2022-01-02  1.002429  1.563290  0.035916 -0.355778
2022-01-04 -0.314098  2.445542 -0.863728 -1.407650

In [20]:
ｄｆ[0:3]

                   A         B         C         D
2022-01-01 -1.183414  0.770003 -0.060545 -1.236191
2022-01-02  1.002429  1.563290  0.035916 -0.355778
2022-01-03 -0.785224 -0.281932 -1.140960 -1.265404

In [21]:
df['20220102' : '20220104']

                   A         B         C         D
2022-01-02  1.002429  1.563290  0.035916 -0.355778
2022-01-03 -0.785224 -0.281932 -1.140960 -1.265404
2022-01-04 -0.314098  2.445542 -0.863728 -1.407650

In [23]:
df.loc['20220101']

A   -1.183414
B    0.770003
C   -0.060545
D   -1.236191
Name: 2022-01-01 00:00:00, dtype: float64

In [27]:
df.loc['20220102', ['A', 'B']]

A    1.002429
B    1.563290
Name: 2022-01-02 00:00:00, dtype: float64

In [29]:
df.loc['20220102' : '20220104', ['A', 'B']]

                   A         B
2022-01-02  1.002429  1.563290
2022-01-03 -0.785224 -0.281932
2022-01-04 -0.314098  2.445542

In [30]:
df.loc[:, ['A', 'B']]

                   A         B
2022-01-01 -1.183414  0.770003
2022-01-02  1.002429  1.563290
2022-01-03 -0.785224 -0.281932
2022-01-04 -0.314098  2.445542
2022-01-05 -0.142732  1.139294
2022-01-06 -1.086993 -1.355432

In [36]:
df.iloc[0, 0]

-1.1834138117842965

In [37]:
df.iloc[0:2, 0:2]

                   A         B
2022-01-01 -1.183414  0.770003
2022-01-02  1.002429  1.563290

In [33]:
df[df.A > 0]

                   A        B         C         D
2022-01-02  1.002429  1.56329  0.035916 -0.355778

In [35]:
df[df > 0]

                   A         B         C   D
2022-01-01       NaN  0.770003       NaN NaN
2022-01-02  1.002429  1.563290  0.035916 NaN
2022-01-03       NaN       NaN       NaN NaN
2022-01-04       NaN  2.445542       NaN NaN
2022-01-05       NaN  1.139294  0.914375 NaN
2022-01-06       NaN       NaN  2.170600 NaN

In [38]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2022-01-01 -1.183414  0.770003 -0.060545 -1.236191    one
2022-01-02  1.002429  1.563290  0.035916 -0.355778    one
2022-01-03 -0.785224 -0.281932 -1.140960 -1.265404    two
2022-01-04 -0.314098  2.445542 -0.863728 -1.407650  three
2022-01-05 -0.142732  1.139294  0.914375 -0.109881   four
2022-01-06 -1.086993 -1.355432  2.170600 -0.791787  three

In [40]:
df2[df2['E'].isin(['one', 'four'])]

                   A         B         C         D     E
2022-01-01 -1.183414  0.770003 -0.060545 -1.236191   one
2022-01-02  1.002429  1.563290  0.035916 -0.355778   one
2022-01-05 -0.142732  1.139294  0.914375 -0.109881  four

In [45]:
df2.shift(1)

                   A         B         C         D      E
2022-01-01       NaN       NaN       NaN       NaN    NaN
2022-01-02 -1.183414  0.770003 -0.060545 -1.236191    one
2022-01-03  1.002429  1.563290  0.035916 -0.355778    one
2022-01-04 -0.785224 -0.281932 -1.140960 -1.265404    two
2022-01-05 -0.314098  2.445542 -0.863728 -1.407650  three
2022-01-06 -0.142732  1.139294  0.914375 -0.109881   four

In [46]:
df = pd.DataFrame(np.random.randn(2, 2))
df

         0         1
0 -0.35504 -1.162524
1  1.39356 -0.949194

In [47]:
pd.concat([df, df])

         0         1
0 -0.35504 -1.162524
1  1.39356 -0.949194
0 -0.35504 -1.162524
1  1.39356 -0.949194

In [48]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar'], 'B': np.random.randn(4)})
df

     A         B
0  foo  1.952746
1  bar  0.746073
2  foo  0.148585
3  bar -1.248833

In [49]:
df.groupby('A').sum()

           B
A
bar -0.50276
foo  2.10133